Tekla.Structures.DrawingInternal.DrawingChecker
A static class that provides useful helper tool(s) for dimensions.

Tekla.Structures.DrawingInternal.DrawingChecker.DrawingCheckerFetchCurrentDrawingErrors(Tekla.Structures.DrawingInternal.DrawingCheckerType)
This function returns a List of drawing object runtime ID's.
CheckType: The type of check being run.
Returns: The drawing object ids with errors.